{
	"date": "09/11/2025",
	"title": "Alien: Isolation",
	"year": 2014,
	"before": false,
	"review": "A brilliant homage to all visual and aural elements of the original movie. Care and attention has been poured into all of the artistry on display here, including amazing looking space station environments and props that have been modelled and brought to life as interactive toys. The sound design and music really helps sell it, as well as the voice acting. There are also intuitive and immersive, yet intentionally cumbersome controls, for example: pulling a lever with two hands requires you to grip both triggers as the character grips the lever, and then also push both sticks downwards to heave it in-game. The result is a space I really enjoyed inhabiting, and most of my motivation for playing through to the end came from a desire to explore all of the Sevastopol, see how it changed, and marvel at the cinematic sights. Unfortunately I can't actually recommend it due to some crippling issues, that make for a real mixed bag compared to the slick, polished {Resident Evil 2} remake I played a few wees ago. Rough edges in gameplay permeate every level and every moment of gameplay. Controller support is poor when it comes to gunplay, but mouse and keyboard layouts feel bizarre with those complex interaction controls I mentioned earlier, and UI elements like the weapon wheel are very poor with the mouse too. Hitboxes for picking up items and activating switches were awkward and it sometimes took a while to find out exactly where to sand before on-screen prompts appeared. I was disappointed by the unrealised potential of the stealth sandbox that the game is centred around. You have a variety of weapons and gadgets but they don't all illicit a response from each enemy, and while some enemies were oblivious to you opening and closing doors right next to them, others would see you and attack you from so far away you would never have a chance of spotting them first. Stealth games totally break down if there are areas you can enter to become undetectable, like ventilation shafts where certain perusing enemies forget you exist immediately after they watch you crawl inside. The genre also doesn't work particularly well with instant failure states, and there are plenty of enemies here that will kill you in an unavoidable animation if they get too close. The game sometimes throws enemies at you that can only be defeated by one specific weapon, negating all those options and tools for expressive gameplay you thought you had. Clearly they wanted to give players a lot of agency and encourage them to improvise, but the game doesn't have an answer for so many of the decisions you can make, and so quickly punishes you for putting a foot out of line. When people talk about polished stealth games like {Hitman} or {Metal Gear Solid} they always say their favourite moments were when things went wrong and they had to change their plan on the fly. This just can't happen when there's a Xenomorph involved, and being spotted means having to load your last save after a few seconds of brutality. Some encounters are entirely scripted, so there is no way to avoid them, and they serve as gates that consume you limited resources as are forced to engage in combat. The plot is also a big problem; although it starts with a compelling main character motivation, she forgets about it once the alien shows up. Most of the game is spent hearing various voices on the radio telling you to move around the station flipping power switches for them. This feels like a series of chores that achieve nothing narratively and simply unlock the next level, for characters you know won't survive. {Portal 2} is the benchmark for how to make a linear series of objectives seem like real progress with a plot that propels you forwards. In that game, you feel like you are doing something important when in fact you are really just solving about 60 puzzles in a fixed order. In terms of scares, when this game is at it's unpredictable and unscripted best, it's incredible. Much like the film franchise, it's all about visceral shocks rather than more psychological elements, and that's OK. It certainly made me jump. I just wish I had a little bit more fun, and wasn't frustrated with it's flaws and missed potential quite so much.",
	"rating": 6,
	"word": "Janky",
	"suspense": 7,
	"shock": 9,
	"grotesque": 7,
	"media": "game"
}