{
    "date": "22/01/2025",
    "title": "Fright Night",
    "year": 2011,
    "seen": false,
    "review": "A real garbage movie with an inexplicably high budget and famous cast. It sets your expectations as low as possible by using a doggy reaction shot in the first minute, and then never exceeds them. It's a contrived sexy teen comedy with a vampire plot stretched very thinly over it. We don't know anything about the vampire's history, personality or motivations. There's more to the monsters in {Scooby Doo}. We work through a checklist of tedious references to vampire tropes, but no time is taken for character development or worldbuilding. The dialogue made me genuinely angry at times, including a pathetic attempt at foreshadowing that spoils the ending, and a moment where David Tennant's absurd Russel Brand/Jack Sparrow character delivers the script's only attempt at emotion: (as a kid) \"a vampire killed my parents!\" This is nothing more than a comedy horror without any laughs or scares, and plenty of product placement. It was followed by a straight-to-DVD sequel with effectively the same plot.",
    "spoiler": "Will we ever see a movie where they do actually defeat vampires with garlic? It might not make for a very exciting ending. Even if it's useful to repel vampires, then it only lowers the stakes.",
    "rating": 2,
    "word": "Frightful",
    "flamboyant": 3,
    "pious": 2,
    "seedy": 4,
    "tags": [
        "Must be invited in",
        "Transforming into biting mode",
        "Black eyes (biting mode)",
        "Pointy teeth (biting mode)",
        "Fangs (biting mode)",
        "Biting",
        "Blood sucking",
        "Pointy fingernails (biting mode)",
        "Sunlight (exploding)",
        "Garlic (ineffective)",
        "Heightened senses",
        "Fast healing",
        "Long jumping",
        "Super strength",
        "Crosses burn when touched",
        "Holy water",
        "Crucifixion nails (saves those turned by stabee)",
        "Wooden stakes",
        "Camera"
    ]
}