{
    "date": "26/08/2024",
    "title": "Alien: Romulus",
    "year": 2024,
    "seen": false,
    "review": "I was hoping this would capture the feel of the original Alien, as well as its aesthetic and music. The problem is that Alien is so slow and quiet that you could never make a high budget film with the same pacing now. This is more like Aliens with more dialogue, more action and more aliens. Maybe it's a good case study for shot lengths in 1970s movies compared to the 2020s. In the years that have passed it's also picked up inspiration from the likes of Gravity, Dead Space and Alien: Isolation, and it's all the better for it. In fact it's particularly videogame-like because the monsters and mechanics change like new levels throughout. I won't dock any points for not being what I hoped for out of the franchise, and I don't beleive any sequel or adaptation inherrently owes anything to its source material. It's a really entertaining and well made film on its own terms. It contains quite a few throwback moments that didn't need to be there, and the story might have felt more focussed without them, but they add some fun to an otherwise grusome experience. There were also some strange plot holes that I couldn't ignore, like how the high security lockdown room had holes in the door, or why they took their masks off after initially saying the oxygen content of the air was too low. I loved it but I am not the kind of person to get worked up about refernces, lore implications or respect for older installments.",
    "spoilers": "I thought it was over, and then they hit us with a new monster and final scene; the promethebaby was really scary. It was like a different movie at the end there. Also my take on Ian Holm is that it was a good addition, as it asked us some more interesting questions than any other part. As a synthetic replication briefly brought back to life, what are we to think of him? He's not even the same character, just a copy with the same face and voice...",
    "rating": 8,
    "word": "Fast",
    "suspense": 3,
    "shock": 8,
    "grotesque": 8
}