{
	"date": "23/11/2024",
	"title": "2001: A Space Odyssey",
	"year": 1968,
	"before": true,
	"review": "It's just amazing how good this is. It looks amazing for 1968. It's scary, pensive, quiet, loud and tense. The way it uses music has stuck in people's minds for over 50 years. It is incredibly prescient concerning technology, human colonisation, artificial intelligence and it's shortcomings. HAL is described as being able to \"reproduce, though some experts prefer to use the word mimic, most of the activities of the human brain\" in a way that we're still all thinking about with today's technology. It leaves you with so many questions, that if you search for details of this film online now, you'll find thoughtful conversations happening about all aspects of the story. What did HAL want to achieve, if anything? Does {Interstellar}'s help-from-the-future concept extend back to other near-extinction events throughout humanities evolutionary journey? What does the ending mean? This film was released a few months before the mother of all demos, where the future of human-computer interaction was laid out in a way that must have been mind-blowing. This film also shows off a very restrained and accurate prediction of our relationship to technology at the start of the 21st century. A few things have aged poorly, including the fashion and the accents of some characters. People laugh at Tom Hank's accent in the farthest storyline of {Cloud Atlas} because it's rare and jarring when writers attempt to predict how our language will evolve in the future. There is so much intensity in still shots of a red LED with no dialogue and nothing but the hum of space ship air conditioning in the background. The close ups of HAL's camera are some of my favourite shots, along with the cut from the bone to the satellite, the first ship docking, and the shot where Dave walks around the looping corridor on the Discovery One. That last one is one of several shots where I can't imagine how they did it with in-camera effects. I don't think we could make another film like this if we tried, and I don't think Hollywood would try, as its lop sided and slow nature wouldn't pass in modern focus groups. I absolutely loved rewatching it, but it's not that rewatchable in general because of how long it takes before the most important characters are introduced. If you saw it too often you might find yourself wanting to skip forward to the parts you like most.",
	"spoilers": "Why did HAL report a malfunction? Based on my current understanding of AI, I think the part was working correctly, there was no human error, and the only error was within HAL. Does HAL have a hidden motive? Is HAL just a language model like ChatGPT, and if so, does that mean that he simply talked enough that he eventually said something incorrect?I assume HAL is not conscious in the way humans are, and has no internal life. At the point where he reported the malfunction, I assume he didn't intend to kill the humans, and didn't know he was making a mistake. His mistake was innocent, his murders were only in self defense, and destroying him was not immoral. What do you think?",
	"rating": 10,
	"word": "Pod",
	"rewatchability": 7
}