{
	"date": "15/11/2024",
	"title": "Tenet",
	"year": 2020,
	"seen": true,
	"review": "I really liked this upon second viewing. I gave it a decent rating last time but my review this time is going to sound much more positive. I am more receptive to the interesting ideas Nolan has about what information the viewer needs to know to enjoy an action espionage thriller. The pacing is breakneck because he's decided that getting whisked away on an adventure without any planning is more exciting. The characters know they have to explain the premise to the protagonist, but then do so quickly and matter-of-factly because they're all familiar with the situation and what's about to happen, and they know in the future the protagonist will become an expert. He strips out any human relationships except the ones that are directly tied to the mission, and doesn't even tell you the protagonists name, joking about it, in a self-aware focus on vibes over details. The MacGuffin itself looks like a crankshaft, and like everything else in the movie that isn't explained, there's a good reason why they avoid any detail. I can't imagine how much work went into script editing to make sure the information conveyed was this lean, letting the viewer know exactly enough to keep them engaged, without any extraneous dialogue. And yet the film does just enough to sow the seeds of fan theories and mysteries, giving you food for thought afterwards about there character's pasts and futures, and about the various paradoxes. It's not like a worse version of {Inception}, as I wrote previously. It's a braver, more refined and complex version of {Inception}, with more of what keeps people thinking about it, at the expense of some of its charm. This is what {Primer} would be like if the budget was literally 30,000 times higher. Can you imagine how cool it would be if this came out at a time where every action movie had a videogame adaptation? I want to play {Tenet: The Official Game of the Movie} on PlayStation 2! It would be a classic 7/10 game, but I'd love it.",
	"rating": 9,
	"word": "Gnillirht",
	"rewatchability": 9
}